Autodesk.Revit.DB.Structure.RebarShapeDefinition.RemoveParameter(Autodesk.Revit.DB.ElementId)
Remove the parameter from the definition.
Remarks:
If the definition does not have the parameter, the method does nothing.
paramId:
Id of a parameter in the definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.SetParameterFormula(Autodesk.Revit.DB.ElementId,System.String)
Associate a formula with the parameter.
paramId:
Id of a parameter in the definition.
formula:
The formula expressed as a string. The string is exactly what a user would
type into the Family Types dialog, e.g. "Total Length*3.14159*(Bar Diameter/2)*(Bar Diameter/2)"
Throws Autodesk.Revit.Exceptions.ArgumentException:
This RebarShapeDefinition does not have a value for the parameter paramId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.SetParameterDefaultValue(Autodesk.Revit.DB.ElementId,System.Double)
Change the parameter's value as stored in the definition.
paramId:
Id of a parameter in the definition.
value:
New value for the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This RebarShapeDefinition does not have a value for the parameter paramId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.GetParameterFormula(Autodesk.Revit.DB.ElementId)
Return the parameter's formula, if one is associated with it.
paramId:
Id of a parameter in the definition.
Returns:
The formula, or an empty string if there is no formula for the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This RebarShapeDefinition does not have a value for the parameter paramId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.GetParameterDefaultValue(Autodesk.Revit.DB.ElementId)
Return the parameter's default value as stored in the definition.
paramId:
Id of a parameter in the definition.
Returns:
The parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This RebarShapeDefinition does not have a value for the parameter paramId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.HasParameter(Autodesk.Revit.DB.ElementId)
Whether the definition stores the parameter.
paramId:
Id of a parameter.
Returns:
True if the definition stores the parameter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.AddFormulaParameter(Autodesk.Revit.DB.ElementId,System.String)
Add a formula-driven parameter to the shape definition.
Remarks:
Like AddParameter(), this function introduces a parameter into
the shape definition, but the parameter's value is driven by a formula.
Formula parameters cannot be used in constraints to drive the shape.
The formula is in the same format as in Revit families.
The formula is allowed to refer to other parameters that are
already in the definition, plus the builtin parameters REBAR_INSTANCE_BAR_DIAMETER (bar nominal diameter), REBAR_INSTANCE_BAR_MODEL_DIAMETER (bar model diameter),
REBAR_INSTANCE_BEND_DIAMETER, REBAR_SHAPE_START_HOOK_LENGTH, REBAR_SHAPE_START_HOOK_OFFSET,
REBAR_SHAPE_PARAM_START_HOOK_TAN_LEN, REBAR_SHAPE_PARAM_END_HOOK_TAN_LEN,
REBAR_SHAPE_END_HOOK_LENGTH, REBAR_SHAPE_END_HOOK_OFFSET, REBAR_ELEM_LENGTH,
REBAR_ELEM_TOTAL_LENGTH, and REBAR_ELEM_QUANTITY_OF_BARS.
paramId:
The parameter. To obtain the id of a shared parameter,
call RebarShapeParameters.GetElementIdForExternalDefinition.
formula:
The formula expressed as a string. The string is exactly what a user would
type into the Family Types dialog, e.g. "Total Length*3.14159*(Bar Diameter/2)*(Bar Diameter/2)"
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a shared parameter in the current document,
or its unit type is not UT_Reinforcement_Length or UT_Angle.
-or-
The name of a shared parameter identified by paramId
was already used by another shared parameter of the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009

Autodesk.Revit.DB.Structure.RebarShapeDefinition.AddParameter(Autodesk.Revit.DB.ElementId,System.Double)
Add a parameter to the shape definition.
Remarks:
A shape parameter must be a shared parameter and have value type double.
A parameter must be added to the definition before it can be used to
drive the shape in a RebarShapeConstraint object.
A parameter that does not drive a constraint is legal and will
simply become an editable parameter on any Rebar that is an instance of this RebarShape.
paramId:
The parameter. To obtain the id of a shared parameter,
call RebarShapeParameters.GetElementIdForExternalDefinition.
defaultValue:
A default value for this parameter in shapes. The default values
should be chosen carefully, because they are required to be consistent as a set of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not the id of a shared parameter in the current document,
or its unit type is not UT_Reinforcement_Length or UT_Angle.
-or-
The name of a shared parameter identified by paramId
was already used by another shared parameter of the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2009